TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32_tsl_services.c
  DxSGroupMask = pMCKeyStruct->DxSGroup;
#endif

  if (pMCKeyStruct->Setting.b.LOCKED)
  {
    return;
  }

#if NUMBER_OF_SINGLE_CHANNEL_KEYS > 0
  for (KeyToCheck = 0; KeyToCheck < NUMBER_OF_SINGLE_CHANNEL_KEYS; KeyToCheck++)
  {
    // KeyToCheck and current key are in same group ?
    if (sSCKeyInfo[KeyToCheck].DxSGroup & DxSGroupMask)
    {
      if (sSCKeyInfo[KeyToCheck].Setting.b.LOCKED)
      {
        goto ExitToIdle;
      }
    }
  }
#endif
//# NUMBER_OF_SINGLE_CHANNEL_KEYS > 0

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
  for (KeyToCheck = 0; KeyToCheck < NUMBER_OF_MULTI_CHANNEL_KEYS; KeyToCheck++)
  {
    if (KeyToCheck != KeyIndex)
    {
      // KeyToCheck and current key are in same group ?
      if (sMCKeyInfo[KeyToCheck].DxSGroup & DxSGroupMask)
      {
        if (sMCKeyInfo[KeyToCheck].Setting.b.LOCKED)
        {
          goto ExitToIdle;
        }
      }
    }
  }
#endif
//# NUMBER_OF_MULTI_CHANNEL_KEYS > 1

  pMCKeyStruct->Setting.b.LOCKED = 1;
  return;

#if ((NUMBER_OF_SINGLE_CHANNEL_KEYS > 0) || (NUMBER_OF_MULTI_CHANNEL_KEYS > 1))
ExitToIdle: // The DxS is verified at PRE DETECT state only !
  pMCKeyStruct->Channel[0].IntegratorCounter++; // Increment integrator to never allow DETECT state
  return;
#endif

}


/**
  ******************************************************************************
  * @brief Verify Detection Timeout for current MCKey.
  * @param None
  * @retval None
  ******************************************************************************
  */
void TSL_MCKey_DetectionTimeout(void)
{
  if (Local_TickFlag.b.DTO_1sec)
  {
    if (DetectionTimeout)
    {
      pMCKeyStruct->Counter--;
      if (!pMCKeyStruct->Counter)
      {
        TSL_MCKey_SetCalibrationState();
      }
    }
  }
}

#endif
//# NUMBER_OF_MULTI_CHANNEL_KEYS > 0

//==============================================================================

/* Public functions ----------------------------------------------------------*/

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
